Task

For this challenge you need to create a simple GROUP BY statement, you want to group all the people by their age and count the people who have the same age.
Table Schemas
people

A list of people with their name and age
Name	Type
id	INT
name	STRING
age	INT
Query Schema
Resulting query

Results of people grouped by their age and a count of those who represent the age
Name	Type
age	INT
people_count	INT
Testing Info
Dynamic Table Data

The data within each table is re-generated each time you submit. Do not expect to get the same data back twice.

In order to check accuracy of results, make sure to compare the actual results to the expected.
Test Errors

Tests are done using Ruby, which is why you may see some non-SQL looking errors if something isn't correct

In [ ]:
select age, count(*) as people_count
from people 
group by age;

Task

For this challenge you need to create a simple HAVING statement, you want to count how many people have the same age and return the groups with 10 or more people who have that age.
Table Schema
people

A table of people and their age
Name	Type
id	INT
name	VARCHAR(100)
age	INT
Query Schema
Resulting Query

Age groups and the amount of persons that represent them
Name	Type
age	INT
total_people	INT

In [ ]:
select age, count(*) as total_people
from people 
group by age
having count(*) >= 10;

Task

For this challenge you need to create a simple SELECT statement that will return all columns from the people table, and join to the toys table so that you can return the COUNT of the toys as toy_count.

In [ ]:
select people.*, count(toys.id) as toy_count
from people
left join toys on people.id = toys.people_id
group by people.id;

SQL: Top 10 customers by total payments amount
Overview

For this challenge you will be using a DVD rental database. See below for details on this database.

Your are working for a company that wants to reward its best customers with a free gift. You have been asked to generate a simple report that returns the top 10 customers by selected by total amount spent (from the payments table). The total count of payments and the contact email for each of these customers should also be included in the query.

The query should retrieve the following columns:

    customer_id (int4)
    email (varchar)
    payments_count (int)
    total_amount (float)

and should return rows showing the 10 top-spending customers ordered descending by total amount spent.

There are 15 tables in the DVD Rental database:

    actor – stores actors data including first name and last name.
    film – stores films data such as title, release year, length, rating, etc.
    film_actor – stores the relationships between films and actors.
    category – stores film’s categories data.
    film_category- stores the relationships between films and categories.
    store – contains the store data including manager staff and address.
    inventory – stores inventory data.
    rental – stores rental data.
    payment – stores customer’s payments.
    staff – stores staff data.
    customer – stores customers data.
    address – stores address data for staff and customers
    city – stores the city names.
    country – stores the country names.

select customer.customer_id, customer.email, count(payment.payment_id) as payments_count, cast(sum(payment.amount) as float) as total_amount 
from customer
join payment on customer.customer_id = payment.customer_id
group by customer.customer_id, customer.email
order by total_amount desc
limit 10;

Task

For this challenge you need to create a SELECT statement, this SELECT statement will use an IN to check whether a department has had a sale with a price over 98.00 dollars.
Table Schemas
departments

A list of department names and their IDs
Name	Type
id	INT
name	VARCHAR(100)
sales

A table of sales and its details
Name	Type
id	INT
department_id	INT
name	VARCHAR(100)
price	DECIMAL
card_name	VARCHAR(100)
card_number	VARCHAR(19)
transaction_date	DATE
Query Schema

Names of departments who has had sales greater than $98
Name	Type
id	INT
name	VARCHAR(100)

In [ ]:
select departments.id, departments.name
from departments 
where departments.id in (select sales.department_id 
                        from sales 
                        where sales.price > 98.00);